{
    "intents" : [
        {
            "tag" : "espresso",
            "questions" : [
                "What is espresso?",
                "what kind of drink is espresso?",
                "How is espresso different than coffee?",
                "espresso"
            ],
            "responses" : [
                "Espresso is an Italian originated style of coffee that is brewed by forcing very hot water under high pressure through finely ground compacted coffee."
            ]
        },
        {
            "tag" : "coffee",
            "questions" : [
                "What is coffee?",
                "What kind of drink is coffee?",
                "What does coffee look like?",
                "coffee"
            ],
            "responses" : [
                "A drink brewed from roasted coffee beans. It is usually darkly colored, somewhat acidic and can have a stimulating effect due to the presence of caffeine. Coffee can be prepared in a number of ways including espresso, french press, drip, pour over, moka pot, etc." 
            ]
        },
        {
            "tag" : "espresso machine",
            "questions" : [
                "What is an espresso machine",
                "What do you use to make espresso",
                "What does an espresso machine do?",
                "espresso machine"
            ],
            "responses" : [
                "An espresso machine is an appliance that brews espresso by forcing pressurized water through a puck of finely ground coffee beans. They will often come with a steam wand used to steam milk for espresso-based beverages."
            ]
        },
        {
            "tag" : "brew time",
            "questions" : [
                "How long do you brew espresso?",
                "What is the brewing time for espresso?",
                "brew time for espresso"
            ],
            "responses" : [
                "The ideal brewing time for a standard double shot of espresso is 25 - 30 seconds. Experts have found it gives the espresso the best extraction, flavor profile, and crema formation."
            ]
        },
        {
            "tag" : "coffee bean",
            "questions" : [
                "What is a coffee bean?",
                "How are coffee beans used in espresso?",
                "coffee bean"
            ],
            "responses" : [
                "The coffee bean is the seeds of the coffee plant that are extracted from the coffee fruit. The process of producing coffee from the seeds includes drying, roasting, grinding, and brewing. The roasting process is significantly important to flavor of the coffee produced."
   
            ]
        },
        {
            "tag" : "pressure",
            "questions" : [
                "What is the pressure?",
                "How much pressure do you need to brew espresso?",
                "pressure"
            ],
            "responses" : [
                "A standard espresso machine will brew between 8 and 10 bars, with 9 bars being the optimal for a good flavor. A 'bar' is a unit of measurement for pressure, where 1 bar is around the atmospheric pressure at sea level."
            ]
        },
        {
            "tag" : "shot",
            "questions" : [
                "How big is a shot of espresso?",
                "What is a shot?",
                "shot"
            ],
            "responses" : [
                "A single shot of espresso is around 1oz of espresso and uses around 7-9 grams of finely ground coffee, and a double shot is around 2oz of espresso and uses around 14-18 gram of finely ground coffee"
            ]
        },
        {
            "tag" : "crema",
            "questions" : [
                "What is crema?",
                "What does the crema taste like?",
                "crema"
            ],
            "responses" : [
                "The crema of a shot of espresso is the golden layer of foam that sits on top of the espresso. It is composed of oils, protein, and carbon dioxide released during extraction. Its presence is generally indicative of a nicely pulled shot."
            ]
        },
        {
            "tag" : "roasting",
            "questions" : [
                "What is roasting?",
                "How do you roast for espresso?",
                "roasting"
            ],
            "responses" : [
                "The roasting of raw coffee beans is a very important factor in the flavor of the resulting coffee. Before roasting the coffee, the beans are green. Coffee roasting is typically done in special roasting machines where time and temperature are closely monitored. The time it takes to roast varied and can determine the development of flavor and level of roast (dark, light, medium)"
            ]
        },
        {
            "tag" : "steaming",
            "questions" : [
                "How do you steam milk?",
                "How do you froth milk",
                "froth milk",
                "steam milk",
                "steam"
            ],
            "responses" : [
                "Espresso machines typically come with a steam wand to heat and froth milk for espresso based drinks. The machines boiler heats water which the steam wand uses for milk texturing."
            ]
        },
        {
            "tag" : "brew",
            "questions" : [
                "How do you brew espresso?",
                "What do you need to brew espresso?",
                "What is the process of making espresso?",
                "What is the process of brewing espresso?",
                "brew"
            ],
            "responses" : [
                "espresso is brewed by forcing very hot water under high pressure through a finely ground compacted puck of coffee. The grounds are compacted in the espresso machines portafilter using a tamper" 
    
            ]
        },
        {
            "tag" : "caffeine",
            "questions" : [
                "How much caffeine is in espresso?",
                "caffeine"
            ],
            "responses" : [
                "A typical double shot of espresso has around 125mg of caffeine and a single shot of espresso has around 63 milligrams of caffeine, although the exact caffeine content may vary due to the bean type and various brewing variables."
            ]
        },
        {
            "tag" : "drinks",
            "questions" : [
                "What are espresso drinks?",
                "What is added to espresso?",
                "what are the types of espresso drinks?",
                "drink"
            ],
            "responses" : [
                "There are many espresso based drinks such as lattes, americanos, cappuccinos, etc. that have added ingredients such as steamed milk, milk foam, chocolate, water etc."

            ]
        },
        {
            "tag" : "grinder",
            "questions" : [
                "What is a grinder?",
                "What is a coffee grinder?",
                "grinder"
            ],
            "responses" : [
                "A grinder is a machine used to grind the coffee bean into fine peices/particles for brewing coffee. Burr grinders are recommended for espresso as they produce more consistenly sized coffee grounds."

            ]
        },
        {
            "tag" : "temperature",
            "questions" : [
                "What temperature for espresso?",
                "How hot is the water to make espresso?",
                "tempurature"
            ],
            "responses" : [
                "The recommended temperature to brew espresso is between 195 - 205 degrees farenheigt (90-96 celcius)"

            ]
        }
    ]
}
